## Terraform Plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.compute.google_cloud_run_v2_job.ingestion will be created
  + resource "google_cloud_run_v2_job" "ingestion" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + effective_annotations    = (known after apply)
      + effective_labels         = (known after apply)
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "europe-west1"
      + name                     = "datatalent-ingestion-job"
      + observed_generation      = (known after apply)
      + project                  = "cartographie-data-engineer"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = (known after apply)
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = (known after apply)

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 1
              + service_account       = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
              + timeout               = "1800s"

              + containers {
                  + image = "europe-west1-docker.pkg.dev/cartographie-data-engineer/datatalent/ingestion:latest"

                  + env {
                      + name  = "GCP_PROJECT_ID"
                      + value = "cartographie-data-engineer"
                    }
                  + env {
                      + name  = "INGESTION_FRANCE_TRAVAIL_PREFIX"
                      + value = "raw/france_travail/"
                    }
                  + env {
                      + name  = "INGESTION_GEO_PREFIX"
                      + value = "raw/geo/"
                    }
                  + env {
                      + name  = "INGESTION_RAW_BUCKET"
                      + value = "datatalent-dev-cartographie-data-engineer-raw"
                    }
                  + env {
                      + name  = "INGESTION_SIRENE_PREFIX"
                      + value = "raw/sirene/"
                    }
                  + env {
                      + name = "DATAGOUV_API_KEY"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "DATAGOUV_API_KEY"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name = "FT_CLIENT_ID"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "FT_CLIENT_ID"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name = "FT_CLIENT_SECRET"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "FT_CLIENT_SECRET"
                              + version = "latest"
                            }
                        }
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }
    }

  # module.compute.google_cloud_run_v2_job_iam_member.job_invoker["ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"] will be created
  + resource "google_cloud_run_v2_job_iam_member" "job_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "serviceAccount:ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + name     = "datatalent-ingestion-job"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.compute.time_sleep.wait_for_iam_propagation will be created
  + resource "time_sleep" "wait_for_iam_propagation" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.scheduler.google_cloud_scheduler_job.ingestion["france_travail"] will be created
  + resource "google_cloud_scheduler_job" "ingestion" {
      + attempt_deadline = "320s"
      + description      = "Trigger Cloud Run Job for source france_travail"
      + id               = (known after apply)
      + name             = "datatalent-ingestion-france_travail"
      + paused           = (known after apply)
      + project          = "cartographie-data-engineer"
      + region           = "europe-west1"
      + schedule         = "0 6 * * *"
      + state            = (known after apply)
      + time_zone        = "Europe/Paris"

      + http_target {
          + body        = "eyJvdmVycmlkZXMiOnsiY29udGFpbmVyT3ZlcnJpZGVzIjpbeyJlbnYiOlt7Im5hbWUiOiJJTkdFU1RJT05fU09VUkNFIiwidmFsdWUiOiJmcmFuY2VfdHJhdmFpbCJ9XX1dfX0="
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/cartographie-data-engineer/locations/europe-west1/jobs/datatalent-ingestion-job:run"

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.scheduler.google_cloud_scheduler_job.ingestion["geo"] will be created
  + resource "google_cloud_scheduler_job" "ingestion" {
      + attempt_deadline = "320s"
      + description      = "Trigger Cloud Run Job for source geo"
      + id               = (known after apply)
      + name             = "datatalent-ingestion-geo"
      + paused           = (known after apply)
      + project          = "cartographie-data-engineer"
      + region           = "europe-west1"
      + schedule         = "0 4 1 * *"
      + state            = (known after apply)
      + time_zone        = "Europe/Paris"

      + http_target {
          + body        = "eyJvdmVycmlkZXMiOnsiY29udGFpbmVyT3ZlcnJpZGVzIjpbeyJlbnYiOlt7Im5hbWUiOiJJTkdFU1RJT05fU09VUkNFIiwidmFsdWUiOiJnZW8ifV19XX19"
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/cartographie-data-engineer/locations/europe-west1/jobs/datatalent-ingestion-job:run"

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.scheduler.google_cloud_scheduler_job.ingestion["sirene"] will be created
  + resource "google_cloud_scheduler_job" "ingestion" {
      + attempt_deadline = "320s"
      + description      = "Trigger Cloud Run Job for source sirene"
      + id               = (known after apply)
      + name             = "datatalent-ingestion-sirene"
      + paused           = (known after apply)
      + project          = "cartographie-data-engineer"
      + region           = "europe-west1"
      + schedule         = "0 3 1 * *"
      + state            = (known after apply)
      + time_zone        = "Europe/Paris"

      + http_target {
          + body        = "eyJvdmVycmlkZXMiOnsiY29udGFpbmVyT3ZlcnJpZGVzIjpbeyJlbnYiOlt7Im5hbWUiOiJJTkdFU1RJT05fU09VUkNFIiwidmFsdWUiOiJzaXJlbmUifV19XX19"
          + headers     = {
              + "Content-Type" = "application/json"
            }
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/cartographie-data-engineer/locations/europe-west1/jobs/datatalent-ingestion-job:run"

          + oauth_token {
              + scope                 = "https://www.googleapis.com/auth/cloud-platform"
              + service_account_email = "ingestion-sa@cartographie-data-engineer.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.storage.google_storage_bucket.raw will be updated in-place
  ~ resource "google_storage_bucket" "raw" {
        id                          = "datatalent-dev-cartographie-data-engineer-raw"
        name                        = "datatalent-dev-cartographie-data-engineer-raw"
        # (15 unchanged attributes hidden)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                    = 30
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }
      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 90
              + matches_prefix         = [
                  + "raw/geo/",
                ]
              + matches_storage_class  = []
              + matches_suffix         = []
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage.google_storage_bucket_iam_member.dbt_object_viewer[0] will be created
  + resource "google_storage_bucket_iam_member" "dbt_object_viewer" {
      + bucket = "datatalent-dev-cartographie-data-engineer-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:dbt-sa@cartographie-data-engineer.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.warehouse.google_bigquery_table.raw_france_travail_offres[0] will be created
  + resource "google_bigquery_table" "raw_france_travail_offres" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "raw"
      + deletion_protection             = false
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "cartographie-data-engineer"
      + schema                          = (known after apply)
      + self_link                       = (known after apply)
      + table_id                        = "france_travail_offres"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + external_data_configuration {
          + autodetect    = true
          + compression   = "NONE"
          + schema        = (known after apply)
          + source_format = "PARQUET"
          + source_uris   = [
              + "gs://datatalent-dev-cartographie-data-engineer-raw/raw/france_travail/*.parquet",
            ]
        }
    }

  # module.warehouse.google_bigquery_table.raw_sirene_etablissements[0] will be created
  + resource "google_bigquery_table" "raw_sirene_etablissements" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "raw"
      + deletion_protection             = false
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "cartographie-data-engineer"
      + schema                          = (known after apply)
      + self_link                       = (known after apply)
      + table_id                        = "sirene_etablissements"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + external_data_configuration {
          + autodetect    = true
          + compression   = "NONE"
          + schema        = (known after apply)
          + source_format = "PARQUET"
          + source_uris   = [
              + "gs://datatalent-dev-cartographie-data-engineer-raw/raw/sirene/etablissements/*.parquet",
            ]
        }
    }

  # module.warehouse.google_bigquery_table.raw_sirene_unites_legales[0] will be created
  + resource "google_bigquery_table" "raw_sirene_unites_legales" {
      + allow_resource_tags_on_deletion = false
      + creation_time                   = (known after apply)
      + dataset_id                      = "raw"
      + deletion_protection             = false
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "cartographie-data-engineer"
      + schema                          = (known after apply)
      + self_link                       = (known after apply)
      + table_id                        = "sirene_unites_legales"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + external_data_configuration {
          + autodetect    = true
          + compression   = "NONE"
          + schema        = (known after apply)
          + source_format = "PARQUET"
          + source_uris   = [
              + "gs://datatalent-dev-cartographie-data-engineer-raw/raw/sirene/unites_legales/*.parquet",
            ]
        }
    }

Plan: 10 to add, 1 to change, 0 to destroy.

```